<!-- dflook/terraform-github-actions {"workspace":"default","backend":"a9df21abd9bd3b8d3126404e5938e9842dce3e507d7427d6ce6e02c3c27d0980","backend_type":"artifactory"} -->
Terraform plan in __terraform/keycloak__
<details>
<summary>Plan: 152 to add, 8 to change, 152 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.keycloak_dev.module.azureidir.data.keycloak_authentication_execution.browser_identity_provider_redirector will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "keycloak_authentication_execution" "browser_identity_provider_redirector" {
      + id                = (known after apply)
      + parent_flow_alias = "browser"
      + provider_id       = "****************************"
      + realm_id          = "*********"
    }

  # module.keycloak_dev.module.azureidir.keycloak_authentication_execution_config.browser_identity_provider_redirector_config must be replaced
-/+ resource "keycloak_authentication_execution_config" "browser_identity_provider_redirector_config" {
      ~ execution_id = "************************************" -> (known after apply) # forces replacement
      ~ id           = "************************************" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbasic.data.keycloak_authentication_execution.browser_identity_provider_redirector will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_authentication_execution" "browser_identity_provider_redirector" {
      + id                = (known after apply)
      + parent_flow_alias = "browser"
      + provider_id       = "****************************"
      + realm_id          = (known after apply)
    }

  # module.keycloak_dev.module.bceidbasic.keycloak_authentication_execution_config.browser_identity_provider_redirector_config must be replaced
-/+ resource "keycloak_authentication_execution_config" "browser_identity_provider_redirector_config" {
      ~ alias        = "bceidbasic" -> "BCeID (Basic)" # forces replacement
      ~ config       = {
          ~ "defaultProvider" = "bceidbasic" -> "BCeID (Basic)"
        }
      ~ execution_id = "************************************" -> (known after apply) # forces replacement
      ~ id           = "************************************" -> (known after apply)
      ~ realm_id     = "**********" -> (known after apply) # forces replacement
    }

  # module.keycloak_dev.module.bceidbasic.keycloak_custom_identity_provider_mapper.bceidbasic_bceid_user_guid must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bceidbasic_bceid_user_guid" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbasic" -> "BCeID (Basic)" # forces replacement
        name                     = "bceid_user_guid"
      ~ realm                    = "bceidbasic" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbasic.keycloak_custom_identity_provider_mapper.bceidbasic_bceid_username must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bceidbasic_bceid_username" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbasic" -> "BCeID (Basic)" # forces replacement
        name                     = "bceid_username"
      ~ realm                    = "bceidbasic" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbasic.keycloak_custom_identity_provider_mapper.bceidbasic_displayname must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bceidbasic_displayname" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbasic" -> "BCeID (Basic)" # forces replacement
        name                     = "display_name"
      ~ realm                    = "bceidbasic" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbasic.keycloak_custom_identity_provider_mapper.bceidbasic_email must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bceidbasic_email" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbasic" -> "BCeID (Basic)" # forces replacement
        name                     = "email"
      ~ realm                    = "bceidbasic" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbasic.keycloak_openid_client_scope.idp_scope must be replaced
-/+ resource "keycloak_openid_client_scope" "idp_scope" {
      ~ description            = "bceidbasic idp client scope" -> "BCeID (Basic) idp client scope"
      ~ id                     = "************************************" -> (known after apply)
      ~ name                   = "bceidbasic" -> "BCeID (Basic)"
      ~ realm_id               = "**********" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.bceidboth.data.keycloak_authentication_execution.browser_identity_provider_redirector will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_authentication_execution" "browser_identity_provider_redirector" {
      + id                = (known after apply)
      + parent_flow_alias = "browser"
      + provider_id       = "****************************"
      + realm_id          = (known after apply)
    }

  # module.keycloak_dev.module.bceidboth.keycloak_authentication_execution_config.browser_identity_provider_redirector_config must be replaced
-/+ resource "keycloak_authentication_execution_config" "browser_identity_provider_redirector_config" {
      ~ alias        = "bceidboth" -> "BCeID (Basic + Business)" # forces replacement
      ~ config       = {
          ~ "defaultProvider" = "bceidboth" -> "BCeID (Basic + Business)"
        }
      ~ execution_id = "************************************" -> (known after apply) # forces replacement
      ~ id           = "************************************" -> (known after apply)
      ~ realm_id     = "*********" -> (known after apply) # forces replacement
    }

  # module.keycloak_dev.module.bceidboth.keycloak_custom_identity_provider_mapper.bceidboth_bceid_business_guid must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bceidboth_bceid_business_guid" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidboth" -> "BCeID (Basic + Business)" # forces replacement
        name                     = "bceid_business_guid"
      ~ realm                    = "bceidboth" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidboth.keycloak_custom_identity_provider_mapper.bceidboth_bceid_business_name must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bceidboth_bceid_business_name" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidboth" -> "BCeID (Basic + Business)" # forces replacement
        name                     = "bceid_business_name"
      ~ realm                    = "bceidboth" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidboth.keycloak_custom_identity_provider_mapper.bceidboth_bceid_user_guid must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bceidboth_bceid_user_guid" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidboth" -> "BCeID (Basic + Business)" # forces replacement
        name                     = "bceid_user_guid"
      ~ realm                    = "bceidboth" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidboth.keycloak_custom_identity_provider_mapper.bceidboth_bceid_username must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bceidboth_bceid_username" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidboth" -> "BCeID (Basic + Business)" # forces replacement
        name                     = "bceid_username"
      ~ realm                    = "bceidboth" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidboth.keycloak_custom_identity_provider_mapper.bceidboth_displayname must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bceidboth_displayname" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidboth" -> "BCeID (Basic + Business)" # forces replacement
        name                     = "display_name"
      ~ realm                    = "bceidboth" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidboth.keycloak_custom_identity_provider_mapper.bceidboth_email must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bceidboth_email" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidboth" -> "BCeID (Basic + Business)" # forces replacement
        name                     = "email"
      ~ realm                    = "bceidboth" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidboth.keycloak_openid_client_scope.idp_scope must be replaced
-/+ resource "keycloak_openid_client_scope" "idp_scope" {
      ~ description            = "bceidboth idp client scope" -> "BCeID (Basic + Business) idp client scope"
      ~ id                     = "************************************" -> (known after apply)
      ~ name                   = "bceidboth" -> "BCeID (Basic + Business)"
      ~ realm_id               = "*********" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.bceidbusiness.data.keycloak_authentication_execution.browser_identity_provider_redirector will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_authentication_execution" "browser_identity_provider_redirector" {
      + id                = (known after apply)
      + parent_flow_alias = "browser"
      + provider_id       = "****************************"
      + realm_id          = (known after apply)
    }

  # module.keycloak_dev.module.bceidbusiness.keycloak_authentication_execution_config.browser_identity_provider_redirector_config must be replaced
-/+ resource "keycloak_authentication_execution_config" "browser_identity_provider_redirector_config" {
      ~ alias        = "bceidbusiness" -> "BCeID (Business)" # forces replacement
      ~ config       = {
          ~ "defaultProvider" = "bceidbusiness" -> "BCeID (Business)"
        }
      ~ execution_id = "************************************" -> (known after apply) # forces replacement
      ~ id           = "************************************" -> (known after apply)
      ~ realm_id     = "*************" -> (known after apply) # forces replacement
    }

  # module.keycloak_dev.module.bceidbusiness.keycloak_custom_identity_provider_mapper.bceidbusiness_bceid_business_guid must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bceidbusiness_bceid_business_guid" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbusiness" -> "BCeID (Business)" # forces replacement
        name                     = "bceid_business_guid"
      ~ realm                    = "bceidbusiness" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbusiness.keycloak_custom_identity_provider_mapper.bceidbusiness_bceid_business_name must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bceidbusiness_bceid_business_name" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbusiness" -> "BCeID (Business)" # forces replacement
        name                     = "bceid_business_name"
      ~ realm                    = "bceidbusiness" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbusiness.keycloak_custom_identity_provider_mapper.bceidbusiness_bceid_user_guid must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bceidbusiness_bceid_user_guid" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbusiness" -> "BCeID (Business)" # forces replacement
        name                     = "bceid_user_guid"
      ~ realm                    = "bceidbusiness" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbusiness.keycloak_custom_identity_provider_mapper.bceidbusiness_bceid_username must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bceidbusiness_bceid_username" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbusiness" -> "BCeID (Business)" # forces replacement
        name                     = "bceid_username"
      ~ realm                    = "bceidbusiness" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbusiness.keycloak_custom_identity_provider_mapper.bceidbusiness_display_name must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bceidbusiness_display_name" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbusiness" -> "BCeID (Business)" # forces replacement
        name                     = "display_name"
      ~ realm                    = "bceidbusiness" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbusiness.keycloak_custom_identity_provider_mapper.bceidbusiness_email must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bceidbusiness_email" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbusiness" -> "BCeID (Business)" # forces replacement
        name                     = "email"
      ~ realm                    = "bceidbusiness" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbusiness.keycloak_openid_client_scope.idp_scope must be replaced
-/+ resource "keycloak_openid_client_scope" "idp_scope" {
      ~ description            = "bceidbusiness idp client scope" -> "BCeID (Business) idp client scope"
      ~ id                     = "************************************" -> (known after apply)
      ~ name                   = "bceidbusiness" -> "BCeID (Business)"
      ~ realm_id               = "*************" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.bcsc.data.keycloak_authentication_execution.browser_identity_provider_redirector will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_authentication_execution" "browser_identity_provider_redirector" {
      + id                = (known after apply)
      + parent_flow_alias = "browser"
      + provider_id       = "****************************"
      + realm_id          = (known after apply)
    }

  # module.keycloak_dev.module.bcsc.keycloak_authentication_execution_config.browser_identity_provider_redirector_config must be replaced
-/+ resource "keycloak_authentication_execution_config" "browser_identity_provider_redirector_config" {
      ~ alias        = "bcsc" -> "BCSC" # forces replacement
      ~ config       = {
          ~ "defaultProvider" = "bcsc" -> "BCSC"
        }
      ~ execution_id = "************************************" -> (known after apply) # forces replacement
      ~ id           = "************************************" -> (known after apply)
      ~ realm_id     = "*****" -> (known after apply) # forces replacement
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_address must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_address" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc" -> "BCSC" # forces replacement
        name                     = "address"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_age must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_age" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc" -> "BCSC" # forces replacement
        name                     = "age"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_age19orover must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_age19orover" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc" -> "BCSC" # forces replacement
        name                     = "age_19_or_over"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_birthdate must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_birthdate" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc" -> "BCSC" # forces replacement
        name                     = "birth_date"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_country must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_country" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc" -> "BCSC" # forces replacement
        name                     = "country"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_displayname must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_displayname" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc" -> "BCSC" # forces replacement
        name                     = "display_name"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_email must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_email" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc" -> "BCSC" # forces replacement
        name                     = "email"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_firstname must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_firstname" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc" -> "BCSC" # forces replacement
        name                     = "first_name"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_lastname must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_lastname" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc" -> "BCSC" # forces replacement
        name                     = "last_name"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_locality must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_locality" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc" -> "BCSC" # forces replacement
        name                     = "locality"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_postal_code must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_postal_code" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc" -> "BCSC" # forces replacement
        name                     = "postal_code"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_sex must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_sex" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc" -> "BCSC" # forces replacement
        name                     = "sex"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_state_or_province must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_state_or_province" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc" -> "BCSC" # forces replacement
        name                     = "state_or_province"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_street_address must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_street_address" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc" -> "BCSC" # forces replacement
        name                     = "street_address"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_openid_client_scope.idp_scope must be replaced
-/+ resource "keycloak_openid_client_scope" "idp_scope" {
      ~ description            = "bcsc idp client scope" -> "BCSC idp client scope"
      ~ id                     = "************************************" -> (known after apply)
      ~ name                   = "bcsc" -> "BCSC"
      ~ realm_id               = "*****" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.idir.data.keycloak_authentication_execution.browser_identity_provider_redirector will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_authentication_execution" "browser_identity_provider_redirector" {
      + id                = (known after apply)
      + parent_flow_alias = "browser"
      + provider_id       = "****************************"
      + realm_id          = (known after apply)
    }

  # module.keycloak_dev.module.idir.keycloak_authentication_execution_config.browser_identity_provider_redirector_config must be replaced
-/+ resource "keycloak_authentication_execution_config" "browser_identity_provider_redirector_config" {
      ~ alias        = "idir" -> "IDIR" # forces replacement
      ~ config       = {
          ~ "defaultProvider" = "idir" -> "IDIR"
        }
      ~ execution_id = "************************************" -> (known after apply) # forces replacement
      ~ id           = "************************************" -> (known after apply)
      ~ realm_id     = "****" -> (known after apply) # forces replacement
    }

  # module.keycloak_dev.module.idir.keycloak_custom_identity_provider_mapper.idir_displayname must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "idir_displayname" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "idir" -> "IDIR" # forces replacement
        name                     = "display_name"
      ~ realm                    = "idir" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.idir.keycloak_custom_identity_provider_mapper.idir_email must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "idir_email" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "idir" -> "IDIR" # forces replacement
        name                     = "email"
      ~ realm                    = "idir" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.idir.keycloak_custom_identity_provider_mapper.idir_firstname must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "idir_firstname" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "idir" -> "IDIR" # forces replacement
        name                     = "first_name"
      ~ realm                    = "idir" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.idir.keycloak_custom_identity_provider_mapper.idir_idir_user_guid must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "idir_idir_user_guid" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "idir" -> "IDIR" # forces replacement
        name                     = "idir_user_guid"
      ~ realm                    = "idir" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.idir.keycloak_custom_identity_provider_mapper.idir_idir_username must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "idir_idir_username" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "idir" -> "IDIR" # forces replacement
        name                     = "idir_username"
      ~ realm                    = "idir" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.idir.keycloak_custom_identity_provider_mapper.idir_lastname must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "idir_lastname" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "idir" -> "IDIR" # forces replacement
        name                     = "last_name"
      ~ realm                    = "idir" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.idir.keycloak_openid_client_scope.idp_scope must be replaced
-/+ resource "keycloak_openid_client_scope" "idp_scope" {
      ~ description            = "idir idp client scope" -> "IDIR idp client scope"
      ~ id                     = "************************************" -> (known after apply)
      ~ name                   = "idir" -> "IDIR"
      ~ realm_id               = "****" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["BCeID (Basic + Business)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "******************************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["BCeID (Basic)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "*******************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["BCeID (Business)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "**********************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["IDIR"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "**********"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "***************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "**************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_realm.master will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "keycloak_realm" "master" {
      + access_code_lifespan                     = (known after apply)
      + access_code_lifespan_login               = (known after apply)
      + access_code_lifespan_user_action         = (known after apply)
      + access_token_lifespan                    = (known after apply)
      + access_token_lifespan_for_implicit_flow  = (known after apply)
      + account_theme                            = (known after apply)
      + action_token_generated_by_admin_lifespan = (known after apply)
      + action_token_generated_by_user_lifespan  = (known after apply)
      + admin_theme                              = (known after apply)
      + attributes                               = (known after apply)
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + default_default_client_scopes            = (known after apply)
      + default_optional_client_scopes           = (known after apply)
      + default_signature_algorithm              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + display_name                             = (known after apply)
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = (known after apply)
      + edit_username_allowed                    = (known after apply)
      + email_theme                              = (known after apply)
      + enabled                                  = (known after apply)
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_theme                              = (known after apply)
      + login_with_email_allowed                 = (known after apply)
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = (known after apply)
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = (known after apply)
      + password_policy                          = (known after apply)
      + realm                                    = "master"
      + refresh_token_max_reuse                  = (known after apply)
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = (known after apply)
      + ssl_required                             = (known after apply)
      + sso_session_idle_timeout                 = (known after apply)
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = (known after apply)
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = (known after apply)
      + verify_email                             = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["BCeID (Basic + Business)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["BCeID (Basic)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["BCeID (Business)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["IDIR"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["BCeID (Basic + Business)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["BCeID (Basic)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["BCeID (Business)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["IDIR"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["BCeID (Basic + Business)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["BCeID (Basic)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["BCeID (Business)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["IDIR"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["BCeID (Basic + Business)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["BCeID (Basic)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["BCeID (Business)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["IDIR"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["BCeID (Basic + Business)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["BCeID (Basic)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["BCeID (Business)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["IDIR"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["BCeID (Basic + Business)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["BCeID (Basic)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["BCeID (Business)"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["IDIR"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.keycloak_openid_client.viewer_service_account must be replaced
-/+ resource "keycloak_openid_client" "viewer_service_account" {
      - backchannel_logout_revoke_offline_sessions = false -> null
      ~ client_secret                              = (sensitive value)
      - extra_config                               = {} -> null
      ~ id                                         = "************************************" -> (known after apply)
        name                                       = "viwer-cli"
      ~ realm_id                                   = "******" -> (known after apply) # forces replacement
      + resource_server_id                         = (known after apply)
      ~ service_account_user_id                    = "************************************" -> (known after apply)
      - valid_redirect_uris                        = [] -> null
      - web_origins                                = [] -> null
        # (17 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.master_viewer_role.keycloak_openid_client_service_account_realm_role.viewer_service_account_viewer_role must be replaced
-/+ resource "keycloak_openid_client_service_account_realm_role" "viewer_service_account_viewer_role" {
      ~ id                      = "*************************************************************************" -> (known after apply)
      ~ realm_id                = "******" -> (known after apply) # forces replacement
      ~ service_account_user_id = "************************************" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.master_viewer_role.keycloak_role.viewer must be replaced
-/+ resource "keycloak_role" "viewer" {
      - attributes      = {} -> null
      ~ composite_roles = [
          - "06ec1691-061a-49bd-8997-d66ee6e97ac3",
          - "0e14026c-ecb0-4727-a288-5ee083907a2b",
          - "0f5130ca-be0e-43c6-b923-4400a37f4dba",
          - "10a13789-48da-4769-b45d-c188e9a3fb8a",
          - "124ada00-627a-4561-a8a6-0f5af2b46ae7",
          - "1330209f-28f4-457f-9d2d-082fc67f40d6",
          - "177f8179-6866-4df7-ac41-45d1f35a92e1",
          - "181adb99-5f90-4b26-8cc8-e90e51158518",
          - "1adeb478-dee9-4e79-832d-35cee16a90f0",
          - "1d95dcc3-227e-4c2b-9a57-efb4b16b3519",
          - "38ef2f16-2913-4fd4-8958-e85d569ccb2e",
          - "4546e51b-8ccb-48b9-85e7-091ba37fc6af",
          - "4979cead-6ab4-4503-b696-18f5037031a4",
          - "4b28219a-1ffa-4cbe-9931-5e3833ec1959",
          - "4e379266-ae1f-4a90-a4b0-7fc00828ecf2",
          - "4e596f3e-d1f5-4046-b36a-3278553a1c1f",
          - "65131363-9986-4144-b8bc-b3f07261549a",
          - "65ab9393-bf34-4e6c-be8b-657736b1f339",
          - "6c888bac-a8b0-4099-9a6a-78c494f71dbd",
          - "7760db64-1068-429c-9833-44ac1e5ee4d1",
          - "7afa503e-deef-4180-a256-930b3be84b49",
          - "7d6fc9df-a9b5-4cd3-8a2b-29a4d4b3694d",
          - "83ca8807-7b4d-451f-a65e-6388d121a3f3",
          - "8ac1632e-b598-4dd5-9a45-7e7bebb4f8f3",
          - "8f092661-4c53-43e4-bfb7-64f4f8c43d3b",
          - "9b1c6766-137e-4088-9fb2-019955e35244",
          - "a0aee34b-2a47-4cf7-9ed9-ca200f0b640c",
          - "a0e0d62e-f445-444b-b8a7-216bb668a052",
          - "a465c19c-819c-4242-a3e5-59d65ea729ed",
          - "b004db88-4127-4133-80ce-fed9a2556a1c",
          - "bde3ec85-e92a-4542-a1f6-34cc2e369f8f",
          - "befa61a9-32e8-44a1-93cb-625fb70ef6f4",
          - "c4e6f47b-3b6d-4df1-9057-ee314160c282",
          - "c6834209-61ef-44d4-84fc-76a3db869c8a",
          - "cb8443d5-4909-4999-a943-6bd35b131ed1",
          - "cd4466cd-54bc-49e2-a19f-c4c054da2466",
          - "e1feebc9-cef0-4996-94bb-3ab6af543005",
          - "e772ee42-5b82-4951-b6ab-67c7d9508a85",
          - "e79c1833-e255-4c01-91d5-41dc1e69cbe3",
          - "ec345cb2-699a-443b-a20a-0395db729106",
          - "ed2fe752-ab07-45da-b526-1fa71487c867",
          - "f1f0f62e-cbb8-43a9-9be8-7c057bf5cfb1",
        ] -> (known after apply)
      ~ id              = "************************************" -> (known after apply)
        name            = "viewer"
      ~ realm_id        = "******" -> (known after apply) # forces replacement
    }

  # module.keycloak_dev.module.standard.keycloak_custom_identity_provider_mapper.bceidbasic_username must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bceidbasic_username" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbasic" -> "BCeID (Basic)" # forces replacement
        name                     = "username"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.keycloak_custom_identity_provider_mapper.bceidboth_username must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bceidboth_username" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidboth" -> "BCeID (Basic + Business)" # forces replacement
        name                     = "username"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.keycloak_custom_identity_provider_mapper.bceidbusiness_username must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bceidbusiness_username" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbusiness" -> "BCeID (Business)" # forces replacement
        name                     = "username"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.keycloak_custom_identity_provider_mapper.bcsc_username must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_username" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "BCSC1" # forces replacement
        name                     = "username"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.keycloak_custom_identity_provider_mapper.idir_username must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "idir_username" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "idir" -> "IDIR" # forces replacement
        name                     = "username"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbasic.module.bceidbasic_idp.keycloak_saml_identity_provider.this must be replaced
-/+ resource "keycloak_saml_identity_provider" "this" {
      ~ alias                                  = "bceidbasic" -> "BCeID (Basic)" # forces replacement
      ~ display_name                           = "bceidbasic" -> "BCeID (Basic)"
      ~ id                                     = "**********" -> (known after apply)
      ~ internal_id                            = "************************************" -> (known after apply)
      - principal_attribute                    = "" -> null
      ~ realm                                  = "bceidbasic" -> (known after apply) # forces replacement
      - signature_algorithm                    = "" -> null
      - xml_sign_key_info_key_name_transformer = "" -> null
        # (27 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbasic.module.realm.keycloak_realm.this must be replaced
-/+ resource "keycloak_realm" "this" {
      ~ access_code_lifespan                     = "1m0s" -> "1m"
      ~ access_code_lifespan_login               = "30m0s" -> "30m"
      ~ access_code_lifespan_user_action         = "5m0s" -> "5m"
      ~ access_token_lifespan                    = "************"
      ~ access_token_lifespan_for_implicit_flow  = "**************"
      ~ action_token_generated_by_admin_lifespan = "****************"
      ~ action_token_generated_by_user_lifespan  = "************"
      - attributes                               = {} -> null
      ~ browser_flow                             = "browser" -> (known after apply)
      ~ client_authentication_flow               = "clients" -> (known after apply)
      ~ client_session_idle_timeout              = "**" -> (known after apply)
      ~ client_session_max_lifespan              = "0s" -> (known after apply)
      - default_default_client_scopes            = [] -> null
      - default_optional_client_scopes           = [] -> null
      ~ direct_grant_flow                        = "direct grant" -> (known after apply)
      ~ display_name                             = "bceidbasic" -> "BCeID (Basic)"
      ~ display_name_html                        = "<b>bceidbasic</b>" -> "<b>BCeID (Basic)</b>"
      ~ docker_authentication_flow               = "docker auth" -> (known after apply)
      ~ edit_username_allowed                    = false -> (known after apply)
      ~ id                                       = "**********" -> (known after apply)
      ~ internal_id                              = "**********" -> (known after apply)
      ~ oauth2_device_code_lifespan              = "*****" -> (known after apply)
      ~ oauth2_device_polling_interval           = 5 -> (known after apply)
      ~ offline_session_idle_timeout             = "******************"
      ~ offline_session_max_lifespan             = "1440h0m0s" -> (known after apply)
      ~ realm                                    = "bceidbasic" -> "BCeID (Basic)" # forces replacement
      ~ registration_allowed                     = false -> (known after apply)
      ~ registration_email_as_username           = false -> (known after apply)
      ~ registration_flow                        = "registration" -> (known after apply)
      ~ remember_me                              = false -> (known after apply)
      ~ reset_credentials_flow                   = "reset credentials" -> (known after apply)
      ~ reset_password_allowed                   = false -> (known after apply)
      ~ sso_session_idle_timeout                 = "**************"
      ~ sso_session_idle_timeout_remember_me     = "**" -> (known after apply)
      ~ sso_session_max_lifespan                 = "10h0m0s" -> "10h"
      ~ sso_session_max_lifespan_remember_me     = "0s" -> (known after apply)
      ~ verify_email                             = false -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ otp_policy {
          ~ algorithm         = "HmacSHA1" -> (known after apply)
          ~ digits            = 6 -> (known after apply)
          ~ initial_counter   = 0 -> (known after apply)
          ~ look_ahead_window = 1 -> (known after apply)
          ~ period            = 30 -> (known after apply)
          ~ type              = "totp" -> (known after apply)
        }

      ~ web_authn_passwordless_policy {
          ~ acceptable_aaguids                = [] -> (known after apply)
          ~ attestation_conveyance_preference = "not specified" -> (known after apply)
          ~ authenticator_attachment          = "not specified" -> (known after apply)
          ~ avoid_same_authenticator_register = false -> (known after apply)
          ~ create_timeout                    = 0 -> (known after apply)
          ~ relying_party_entity_name         = "keycloak" -> (known after apply)
          + relying_party_id                  = (known after apply)
          ~ require_resident_key              = "*************" -> (known after apply)
          ~ signature_algorithms              = [
              - "ES256",
            ] -> (known after apply)
          ~ user_verification_requirement     = "not specified" -> (known after apply)
        }

      ~ web_authn_policy {
          ~ acceptable_aaguids                = [] -> (known after apply)
          ~ attestation_conveyance_preference = "not specified" -> (known after apply)
          ~ authenticator_attachment          = "not specified" -> (known after apply)
          ~ avoid_same_authenticator_register = false -> (known after apply)
          ~ create_timeout                    = 0 -> (known after apply)
          ~ relying_party_entity_name         = "keycloak" -> (known after apply)
          + relying_party_id                  = (known after apply)
          ~ require_resident_key              = "*************" -> (known after apply)
          ~ signature_algorithms              = [
              - "ES256",
            ] -> (known after apply)
          ~ user_verification_requirement     = "not specified" -> (known after apply)
        }
    }

  # module.keycloak_dev.module.bceidbasic.module.standard_client.keycloak_openid_client.this must be replaced
-/+ resource "keycloak_openid_client" "this" {
      - backchannel_logout_revoke_offline_sessions = false -> null
      ~ client_secret                              = (sensitive value)
      - extra_config                               = {} -> null
      ~ id                                         = "************************************" -> (known after apply)
        name                                       = "standard-realm"
      ~ realm_id                                   = "**********" -> (known after apply) # forces replacement
      + resource_server_id                         = (known after apply)
      + service_account_user_id                    = (known after apply)
      ~ valid_redirect_uris                        = [
          + "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/standard/broker/BCeID (Basic)/endpoint",
          - "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/standard/broker/bceidbasic/endpoint",
        ]
      - web_origins                                = [] -> null
        # (17 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbasic.module.standard_client.keycloak_openid_client_default_scopes.client_default_scopes must be replaced
-/+ resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      ~ client_id      = "************************************" -> (known after apply) # forces replacement
      ~ id             = "***********************************************" -> (known after apply)
      ~ realm_id       = "**********" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.bceidbasic.module.standard_client.keycloak_openid_client_optional_scopes.client_optional_scopes must be replaced
-/+ resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "***********************************************" -> (known after apply)
      ~ realm_id        = "**********" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.bceidboth.module.bceidboth_idp.keycloak_saml_identity_provider.this must be replaced
-/+ resource "keycloak_saml_identity_provider" "this" {
      ~ alias                                  = "bceidboth" -> "BCeID (Basic + Business)" # forces replacement
      ~ display_name                           = "bceidboth" -> "BCeID (Basic + Business)"
      ~ id                                     = "*********" -> (known after apply)
      ~ internal_id                            = "************************************" -> (known after apply)
      - principal_attribute                    = "" -> null
      ~ realm                                  = "bceidboth" -> (known after apply) # forces replacement
      - signature_algorithm                    = "" -> null
      - xml_sign_key_info_key_name_transformer = "" -> null
        # (27 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidboth.module.realm.keycloak_realm.this must be replaced
-/+ resource "keycloak_realm" "this" {
      ~ access_code_lifespan                     = "1m0s" -> "1m"
      ~ access_code_lifespan_login               = "30m0s" -> "30m"
      ~ access_code_lifespan_user_action         = "5m0s" -> "5m"
      ~ access_token_lifespan                    = "************"
      ~ access_token_lifespan_for_implicit_flow  = "**************"
      ~ action_token_generated_by_admin_lifespan = "****************"
      ~ action_token_generated_by_user_lifespan  = "************"
      - attributes                               = {} -> null
      ~ browser_flow                             = "browser" -> (known after apply)
      ~ client_authentication_flow               = "clients" -> (known after apply)
      ~ client_session_idle_timeout              = "**" -> (known after apply)
      ~ client_session_max_lifespan              = "0s" -> (known after apply)
      - default_default_client_scopes            = [] -> null
      - default_optional_client_scopes           = [] -> null
      ~ direct_grant_flow                        = "direct grant" -> (known after apply)
      ~ display_name                             = "bceidboth" -> "BCeID (Basic + Business)"
      ~ display_name_html                        = "<b>bceidboth</b>" -> "<b>BCeID (Basic + Business)</b>"
      ~ docker_authentication_flow               = "docker auth" -> (known after apply)
      ~ edit_username_allowed                    = false -> (known after apply)
      ~ id                                       = "*********" -> (known after apply)
      ~ internal_id                              = "*********" -> (known after apply)
      ~ oauth2_device_code_lifespan              = "*****" -> (known after apply)
      ~ oauth2_device_polling_interval           = 5 -> (known after apply)
      ~ offline_session_idle_timeout             = "******************"
      ~ offline_session_max_lifespan             = "1440h0m0s" -> (known after apply)
      ~ realm                                    = "bceidboth" -> "BCeID (Basic + Business)" # forces replacement
      ~ registration_allowed                     = false -> (known after apply)
      ~ registration_email_as_username           = false -> (known after apply)
      ~ registration_flow                        = "registration" -> (known after apply)
      ~ remember_me                              = false -> (known after apply)
      ~ reset_credentials_flow                   = "reset credentials" -> (known after apply)
      ~ reset_password_allowed                   = false -> (known after apply)
      ~ sso_session_idle_timeout                 = "**************"
      ~ sso_session_idle_timeout_remember_me     = "**" -> (known after apply)
      ~ sso_session_max_lifespan                 = "10h0m0s" -> "10h"
      ~ sso_session_max_lifespan_remember_me     = "0s" -> (known after apply)
      ~ verify_email                             = false -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ otp_policy {
          ~ algorithm         = "HmacSHA1" -> (known after apply)
          ~ digits            = 6 -> (known after apply)
          ~ initial_counter   = 0 -> (known after apply)
          ~ look_ahead_window = 1 -> (known after apply)
          ~ period            = 30 -> (known after apply)
          ~ type              = "totp" -> (known after apply)
        }

      ~ web_authn_passwordless_policy {
          ~ acceptable_aaguids                = [] -> (known after apply)
          ~ attestation_conveyance_preference = "not specified" -> (known after apply)
          ~ authenticator_attachment          = "not specified" -> (known after apply)
          ~ avoid_same_authenticator_register = false -> (known after apply)
          ~ create_timeout                    = 0 -> (known after apply)
          ~ relying_party_entity_name         = "keycloak" -> (known after apply)
          + relying_party_id                  = (known after apply)
          ~ require_resident_key              = "*************" -> (known after apply)
          ~ signature_algorithms              = [
              - "ES256",
            ] -> (known after apply)
          ~ user_verification_requirement     = "not specified" -> (known after apply)
        }

      ~ web_authn_policy {
          ~ acceptable_aaguids                = [] -> (known after apply)
          ~ attestation_conveyance_preference = "not specified" -> (known after apply)
          ~ authenticator_attachment          = "not specified" -> (known after apply)
          ~ avoid_same_authenticator_register = false -> (known after apply)
          ~ create_timeout                    = 0 -> (known after apply)
          ~ relying_party_entity_name         = "keycloak" -> (known after apply)
          + relying_party_id                  = (known after apply)
          ~ require_resident_key              = "*************" -> (known after apply)
          ~ signature_algorithms              = [
              - "ES256",
            ] -> (known after apply)
          ~ user_verification_requirement     = "not specified" -> (known after apply)
        }
    }

  # module.keycloak_dev.module.bceidboth.module.standard_client.keycloak_openid_client.this must be replaced
-/+ resource "keycloak_openid_client" "this" {
      - backchannel_logout_revoke_offline_sessions = false -> null
      ~ client_secret                              = (sensitive value)
      - extra_config                               = {} -> null
      ~ id                                         = "************************************" -> (known after apply)
        name                                       = "standard-realm"
      ~ realm_id                                   = "*********" -> (known after apply) # forces replacement
      + resource_server_id                         = (known after apply)
      + service_account_user_id                    = (known after apply)
      ~ valid_redirect_uris                        = [
          + "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/standard/broker/BCeID (Basic + Business)/endpoint",
          - "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/standard/broker/bceidboth/endpoint",
        ]
      - web_origins                                = [] -> null
        # (17 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidboth.module.standard_client.keycloak_openid_client_default_scopes.client_default_scopes must be replaced
-/+ resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      ~ client_id      = "************************************" -> (known after apply) # forces replacement
      ~ id             = "**********************************************" -> (known after apply)
      ~ realm_id       = "*********" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.bceidboth.module.standard_client.keycloak_openid_client_optional_scopes.client_optional_scopes must be replaced
-/+ resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "**********************************************" -> (known after apply)
      ~ realm_id        = "*********" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.bceidbusiness.module.bceidbusiness_idp.keycloak_saml_identity_provider.this must be replaced
-/+ resource "keycloak_saml_identity_provider" "this" {
      ~ alias                                  = "bceidbusiness" -> "BCeID (Business)" # forces replacement
      ~ display_name                           = "bceidbusiness" -> "BCeID (Business)"
      ~ id                                     = "*************" -> (known after apply)
      ~ internal_id                            = "************************************" -> (known after apply)
      - principal_attribute                    = "" -> null
      ~ realm                                  = "bceidbusiness" -> (known after apply) # forces replacement
      - signature_algorithm                    = "" -> null
      - xml_sign_key_info_key_name_transformer = "" -> null
        # (27 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbusiness.module.realm.keycloak_realm.this must be replaced
-/+ resource "keycloak_realm" "this" {
      ~ access_code_lifespan                     = "1m0s" -> "1m"
      ~ access_code_lifespan_login               = "30m0s" -> "30m"
      ~ access_code_lifespan_user_action         = "5m0s" -> "5m"
      ~ access_token_lifespan                    = "************"
      ~ access_token_lifespan_for_implicit_flow  = "**************"
      ~ action_token_generated_by_admin_lifespan = "****************"
      ~ action_token_generated_by_user_lifespan  = "************"
      - attributes                               = {} -> null
      ~ browser_flow                             = "browser" -> (known after apply)
      ~ client_authentication_flow               = "clients" -> (known after apply)
      ~ client_session_idle_timeout              = "**" -> (known after apply)
      ~ client_session_max_lifespan              = "0s" -> (known after apply)
      - default_default_client_scopes            = [] -> null
      - default_optional_client_scopes           = [] -> null
      ~ direct_grant_flow                        = "direct grant" -> (known after apply)
      ~ display_name                             = "bceidbusiness" -> "BCeID (Business)"
      ~ display_name_html                        = "<b>bceidbusiness</b>" -> "<b>BCeID (Business)</b>"
      ~ docker_authentication_flow               = "docker auth" -> (known after apply)
      ~ edit_username_allowed                    = false -> (known after apply)
      ~ id                                       = "*************" -> (known after apply)
      ~ internal_id                              = "*************" -> (known after apply)
      ~ oauth2_device_code_lifespan              = "*****" -> (known after apply)
      ~ oauth2_device_polling_interval           = 5 -> (known after apply)
      ~ offline_session_idle_timeout             = "******************"
      ~ offline_session_max_lifespan             = "1440h0m0s" -> (known after apply)
      ~ realm                                    = "bceidbusiness" -> "BCeID (Business)" # forces replacement
      ~ registration_allowed                     = false -> (known after apply)
      ~ registration_email_as_username           = false -> (known after apply)
      ~ registration_flow                        = "registration" -> (known after apply)
      ~ remember_me                              = false -> (known after apply)
      ~ reset_credentials_flow                   = "reset credentials" -> (known after apply)
      ~ reset_password_allowed                   = false -> (known after apply)
      ~ sso_session_idle_timeout                 = "**************"
      ~ sso_session_idle_timeout_remember_me     = "**" -> (known after apply)
      ~ sso_session_max_lifespan                 = "10h0m0s" -> "10h"
      ~ sso_session_max_lifespan_remember_me     = "0s" -> (known after apply)
      ~ verify_email                             = false -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ otp_policy {
          ~ algorithm         = "HmacSHA1" -> (known after apply)
          ~ digits            = 6 -> (known after apply)
          ~ initial_counter   = 0 -> (known after apply)
          ~ look_ahead_window = 1 -> (known after apply)
          ~ period            = 30 -> (known after apply)
          ~ type              = "totp" -> (known after apply)
        }

      ~ web_authn_passwordless_policy {
          ~ acceptable_aaguids                = [] -> (known after apply)
          ~ attestation_conveyance_preference = "not specified" -> (known after apply)
          ~ authenticator_attachment          = "not specified" -> (known after apply)
          ~ avoid_same_authenticator_register = false -> (known after apply)
          ~ create_timeout                    = 0 -> (known after apply)
          ~ relying_party_entity_name         = "keycloak" -> (known after apply)
          + relying_party_id                  = (known after apply)
          ~ require_resident_key              = "*************" -> (known after apply)
          ~ signature_algorithms              = [
              - "ES256",
            ] -> (known after apply)
          ~ user_verification_requirement     = "not specified" -> (known after apply)
        }

      ~ web_authn_policy {
          ~ acceptable_aaguids                = [] -> (known after apply)
          ~ attestation_conveyance_preference = "not specified" -> (known after apply)
          ~ authenticator_attachment          = "not specified" -> (known after apply)
          ~ avoid_same_authenticator_register = false -> (known after apply)
          ~ create_timeout                    = 0 -> (known after apply)
          ~ relying_party_entity_name         = "keycloak" -> (known after apply)
          + relying_party_id                  = (known after apply)
          ~ require_resident_key              = "*************" -> (known after apply)
          ~ signature_algorithms              = [
              - "ES256",
            ] -> (known after apply)
          ~ user_verification_requirement     = "not specified" -> (known after apply)
        }
    }

  # module.keycloak_dev.module.bceidbusiness.module.standard_client.keycloak_openid_client.this must be replaced
-/+ resource "keycloak_openid_client" "this" {
      - backchannel_logout_revoke_offline_sessions = false -> null
      ~ client_secret                              = (sensitive value)
      - extra_config                               = {} -> null
      ~ id                                         = "************************************" -> (known after apply)
        name                                       = "standard-realm"
      ~ realm_id                                   = "*************" -> (known after apply) # forces replacement
      + resource_server_id                         = (known after apply)
      + service_account_user_id                    = (known after apply)
      ~ valid_redirect_uris                        = [
          + "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/standard/broker/BCeID (Business)/endpoint",
          - "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/standard/broker/bceidbusiness/endpoint",
        ]
      - web_origins                                = [] -> null
        # (17 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbusiness.module.standard_client.keycloak_openid_client_default_scopes.client_default_scopes must be replaced
-/+ resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      ~ client_id      = "************************************" -> (known after apply) # forces replacement
      ~ id             = "**************************************************" -> (known after apply)
      ~ realm_id       = "*************" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.bceidbusiness.module.standard_client.keycloak_openid_client_optional_scopes.client_optional_scopes must be replaced
-/+ resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "**************************************************" -> (known after apply)
      ~ realm_id        = "*************" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.bcsc.module.bcsc_idp.keycloak_oidc_identity_provider.this must be replaced
-/+ resource "keycloak_oidc_identity_provider" "this" {
      ~ alias                                   = "bcsc" -> "BCSC" # forces replacement
      ~ display_name                            = "bcsc" -> "BCSC"
      ~ id                                      = "****" -> (known after apply)
      ~ internal_id                             = "************************************" -> (known after apply)
      ~ realm                                   = "bcsc1" -> (known after apply) # forces replacement
        # (27 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.realm.keycloak_realm.this must be replaced
-/+ resource "keycloak_realm" "this" {
      ~ access_code_lifespan                     = "1m0s" -> "1m"
      ~ access_code_lifespan_login               = "30m0s" -> "30m"
      ~ access_code_lifespan_user_action         = "5m0s" -> "5m"
      ~ access_token_lifespan                    = "************"
      ~ access_token_lifespan_for_implicit_flow  = "**************"
      ~ action_token_generated_by_admin_lifespan = "****************"
      ~ action_token_generated_by_user_lifespan  = "************"
      - attributes                               = {} -> null
      ~ browser_flow                             = "browser" -> (known after apply)
      ~ client_authentication_flow               = "clients" -> (known after apply)
      ~ client_session_idle_timeout              = "**" -> (known after apply)
      ~ client_session_max_lifespan              = "0s" -> (known after apply)
      - default_default_client_scopes            = [] -> null
      - default_optional_client_scopes           = [] -> null
      ~ direct_grant_flow                        = "direct grant" -> (known after apply)
      ~ display_name                             = "bcsc1" -> "BCSC1"
      ~ display_name_html                        = "<b>bcsc1</b>" -> "<b>BCSC1</b>"
      ~ docker_authentication_flow               = "docker auth" -> (known after apply)
      ~ edit_username_allowed                    = false -> (known after apply)
      ~ id                                       = "*****" -> (known after apply)
      ~ internal_id                              = "*****" -> (known after apply)
      ~ oauth2_device_code_lifespan              = "*****" -> (known after apply)
      ~ oauth2_device_polling_interval           = 5 -> (known after apply)
      ~ offline_session_idle_timeout             = "******************"
      ~ offline_session_max_lifespan             = "1440h0m0s" -> (known after apply)
      ~ realm                                    = "bcsc1" -> "BCSC1" # forces replacement
      ~ registration_allowed                     = false -> (known after apply)
      ~ registration_email_as_username           = false -> (known after apply)
      ~ registration_flow                        = "registration" -> (known after apply)
      ~ remember_me                              = false -> (known after apply)
      ~ reset_credentials_flow                   = "reset credentials" -> (known after apply)
      ~ reset_password_allowed                   = false -> (known after apply)
      ~ sso_session_idle_timeout                 = "**************"
      ~ sso_session_idle_timeout_remember_me     = "**" -> (known after apply)
      ~ sso_session_max_lifespan                 = "10h0m0s" -> "10h"
      ~ sso_session_max_lifespan_remember_me     = "0s" -> (known after apply)
      ~ verify_email                             = false -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ otp_policy {
          ~ algorithm         = "HmacSHA1" -> (known after apply)
          ~ digits            = 6 -> (known after apply)
          ~ initial_counter   = 0 -> (known after apply)
          ~ look_ahead_window = 1 -> (known after apply)
          ~ period            = 30 -> (known after apply)
          ~ type              = "totp" -> (known after apply)
        }

      ~ web_authn_passwordless_policy {
          ~ acceptable_aaguids                = [] -> (known after apply)
          ~ attestation_conveyance_preference = "not specified" -> (known after apply)
          ~ authenticator_attachment          = "not specified" -> (known after apply)
          ~ avoid_same_authenticator_register = false -> (known after apply)
          ~ create_timeout                    = 0 -> (known after apply)
          ~ relying_party_entity_name         = "keycloak" -> (known after apply)
          + relying_party_id                  = (known after apply)
          ~ require_resident_key              = "*************" -> (known after apply)
          ~ signature_algorithms              = [
              - "ES256",
            ] -> (known after apply)
          ~ user_verification_requirement     = "not specified" -> (known after apply)
        }

      ~ web_authn_policy {
          ~ acceptable_aaguids                = [] -> (known after apply)
          ~ attestation_conveyance_preference = "not specified" -> (known after apply)
          ~ authenticator_attachment          = "not specified" -> (known after apply)
          ~ avoid_same_authenticator_register = false -> (known after apply)
          ~ create_timeout                    = 0 -> (known after apply)
          ~ relying_party_entity_name         = "keycloak" -> (known after apply)
          + relying_party_id                  = (known after apply)
          ~ require_resident_key              = "*************" -> (known after apply)
          ~ signature_algorithms              = [
              - "ES256",
            ] -> (known after apply)
          ~ user_verification_requirement     = "not specified" -> (known after apply)
        }
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.keycloak_openid_client.this must be replaced
-/+ resource "keycloak_openid_client" "this" {
      - backchannel_logout_revoke_offline_sessions = false -> null
      ~ client_secret                              = (sensitive value)
      - extra_config                               = {} -> null
      ~ id                                         = "************************************" -> (known after apply)
        name                                       = "standard-realm"
      ~ realm_id                                   = "*****" -> (known after apply) # forces replacement
      + resource_server_id                         = (known after apply)
      + service_account_user_id                    = (known after apply)
      ~ valid_redirect_uris                        = [
          + "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/standard/broker/BCSC1/endpoint",
          - "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/standard/broker/bcsc1/endpoint",
        ]
      - web_origins                                = [] -> null
        # (17 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.keycloak_openid_client_default_scopes.client_default_scopes must be replaced
-/+ resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      ~ client_id      = "************************************" -> (known after apply) # forces replacement
      ~ id             = "******************************************" -> (known after apply)
      ~ realm_id       = "*****" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.keycloak_openid_client_optional_scopes.client_optional_scopes must be replaced
-/+ resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "******************************************" -> (known after apply)
      ~ realm_id        = "*****" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.idir.module.idir_idp.keycloak_saml_identity_provider.this must be replaced
-/+ resource "keycloak_saml_identity_provider" "this" {
      ~ alias                                  = "idir" -> "IDIR" # forces replacement
      ~ display_name                           = "idir" -> "IDIR"
      ~ id                                     = "****" -> (known after apply)
      ~ internal_id                            = "************************************" -> (known after apply)
      - principal_attribute                    = "" -> null
      ~ realm                                  = "idir" -> (known after apply) # forces replacement
      - signature_algorithm                    = "" -> null
      - xml_sign_key_info_key_name_transformer = "" -> null
        # (27 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.idir.module.realm.keycloak_realm.this must be replaced
-/+ resource "keycloak_realm" "this" {
      ~ access_code_lifespan                     = "1m0s" -> "1m"
      ~ access_code_lifespan_login               = "30m0s" -> "30m"
      ~ access_code_lifespan_user_action         = "5m0s" -> "5m"
      ~ access_token_lifespan                    = "************"
      ~ access_token_lifespan_for_implicit_flow  = "**************"
      ~ action_token_generated_by_admin_lifespan = "****************"
      ~ action_token_generated_by_user_lifespan  = "************"
      - attributes                               = {} -> null
      ~ browser_flow                             = "browser" -> (known after apply)
      ~ client_authentication_flow               = "clients" -> (known after apply)
      ~ client_session_idle_timeout              = "**" -> (known after apply)
      ~ client_session_max_lifespan              = "0s" -> (known after apply)
      - default_default_client_scopes            = [] -> null
      - default_optional_client_scopes           = [] -> null
      ~ direct_grant_flow                        = "direct grant" -> (known after apply)
      ~ display_name                             = "idir" -> "IDIR"
      ~ display_name_html                        = "<b>idir</b>" -> "<b>IDIR</b>"
      ~ docker_authentication_flow               = "docker auth" -> (known after apply)
      ~ edit_username_allowed                    = false -> (known after apply)
      ~ id                                       = "****" -> (known after apply)
      ~ internal_id                              = "****" -> (known after apply)
      ~ oauth2_device_code_lifespan              = "*****" -> (known after apply)
      ~ oauth2_device_polling_interval           = 5 -> (known after apply)
      ~ offline_session_idle_timeout             = "******************"
      ~ offline_session_max_lifespan             = "1440h0m0s" -> (known after apply)
      ~ realm                                    = "idir" -> "IDIR" # forces replacement
      ~ registration_allowed                     = false -> (known after apply)
      ~ registration_email_as_username           = false -> (known after apply)
      ~ registration_flow                        = "registration" -> (known after apply)
      ~ remember_me                              = false -> (known after apply)
      ~ reset_credentials_flow                   = "reset credentials" -> (known after apply)
      ~ reset_password_allowed                   = false -> (known after apply)
      ~ sso_session_idle_timeout                 = "**************"
      ~ sso_session_idle_timeout_remember_me     = "**" -> (known after apply)
      ~ sso_session_max_lifespan                 = "10h0m0s" -> "10h"
      ~ sso_session_max_lifespan_remember_me     = "0s" -> (known after apply)
      ~ verify_email                             = false -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ otp_policy {
          ~ algorithm         = "HmacSHA1" -> (known after apply)
          ~ digits            = 6 -> (known after apply)
          ~ initial_counter   = 0 -> (known after apply)
          ~ look_ahead_window = 1 -> (known after apply)
          ~ period            = 30 -> (known after apply)
          ~ type              = "totp" -> (known after apply)
        }

      ~ web_authn_passwordless_policy {
          ~ acceptable_aaguids                = [] -> (known after apply)
          ~ attestation_conveyance_preference = "not specified" -> (known after apply)
          ~ authenticator_attachment          = "not specified" -> (known after apply)
          ~ avoid_same_authenticator_register = false -> (known after apply)
          ~ create_timeout                    = 0 -> (known after apply)
          ~ relying_party_entity_name         = "keycloak" -> (known after apply)
          + relying_party_id                  = (known after apply)
          ~ require_resident_key              = "*************" -> (known after apply)
          ~ signature_algorithms              = [
              - "ES256",
            ] -> (known after apply)
          ~ user_verification_requirement     = "not specified" -> (known after apply)
        }

      ~ web_authn_policy {
          ~ acceptable_aaguids                = [] -> (known after apply)
          ~ attestation_conveyance_preference = "not specified" -> (known after apply)
          ~ authenticator_attachment          = "not specified" -> (known after apply)
          ~ avoid_same_authenticator_register = false -> (known after apply)
          ~ create_timeout                    = 0 -> (known after apply)
          ~ relying_party_entity_name         = "keycloak" -> (known after apply)
          + relying_party_id                  = (known after apply)
          ~ require_resident_key              = "*************" -> (known after apply)
          ~ signature_algorithms              = [
              - "ES256",
            ] -> (known after apply)
          ~ user_verification_requirement     = "not specified" -> (known after apply)
        }
    }

  # module.keycloak_dev.module.idir.module.standard_client.keycloak_openid_client.this must be replaced
-/+ resource "keycloak_openid_client" "this" {
      - backchannel_logout_revoke_offline_sessions = false -> null
      ~ client_secret                              = (sensitive value)
      - extra_config                               = {} -> null
      ~ id                                         = "************************************" -> (known after apply)
        name                                       = "standard-realm"
      ~ realm_id                                   = "****" -> (known after apply) # forces replacement
      + resource_server_id                         = (known after apply)
      + service_account_user_id                    = (known after apply)
      ~ valid_redirect_uris                        = [
          + "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/standard/broker/IDIR/endpoint",
          - "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/standard/broker/idir/endpoint",
        ]
      - web_origins                                = [] -> null
        # (17 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.idir.module.standard_client.keycloak_openid_client_default_scopes.client_default_scopes must be replaced
-/+ resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      ~ client_id      = "************************************" -> (known after apply) # forces replacement
      ~ id             = "*****************************************" -> (known after apply)
      ~ realm_id       = "****" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.idir.module.standard_client.keycloak_openid_client_optional_scopes.client_optional_scopes must be replaced
-/+ resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "*****************************************" -> (known after apply)
      ~ realm_id        = "****" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.master_idir_link.module.idp_client.keycloak_openid_client.this must be replaced
-/+ resource "keycloak_openid_client" "this" {
      - backchannel_logout_revoke_offline_sessions = false -> null
      ~ client_secret                              = (sensitive value)
      - extra_config                               = {} -> null
      ~ id                                         = "************************************" -> (known after apply)
        name                                       = "master-realm"
      ~ realm_id                                   = "****" -> (known after apply) # forces replacement
      + resource_server_id                         = (known after apply)
      + service_account_user_id                    = (known after apply)
      ~ valid_redirect_uris                        = [
          + "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/master/broker/IDIR/endpoint",
          - "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/master/broker/idir/endpoint",
        ]
      - web_origins                                = [] -> null
        # (17 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.master_idir_link.module.idp_client.keycloak_openid_client_default_scopes.client_default_scopes must be replaced
-/+ resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      ~ client_id      = "************************************" -> (known after apply) # forces replacement
      ~ id             = "*****************************************" -> (known after apply)
      ~ realm_id       = "****" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.master_idir_link.module.idp_client.keycloak_openid_client_optional_scopes.client_optional_scopes must be replaced
-/+ resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "*****************************************" -> (known after apply)
      ~ realm_id        = "****" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.master_idir_link.module.master_idp.keycloak_oidc_identity_provider.this must be replaced
-/+ resource "keycloak_oidc_identity_provider" "this" {
      ~ alias                                   = "idir" -> "IDIR" # forces replacement
      ~ authorization_url                       = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/idir/protocol/openid-connect/auth" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/IDIR/protocol/openid-connect/auth"
      ~ client_secret                           = (sensitive value)
      ~ display_name                            = "idir" -> "IDIR"
      ~ id                                      = "****" -> (known after apply)
      ~ internal_id                             = "************************************" -> (known after apply)
      ~ jwks_url                                = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/idir/protocol/openid-connect/certs" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/IDIR/protocol/openid-connect/certs"
      ~ token_url                               = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/idir/protocol/openid-connect/token" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/IDIR/protocol/openid-connect/token"
      ~ user_info_url                           = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/idir/protocol/openid-connect/userinfo" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/IDIR/protocol/openid-connect/userinfo"
        # (23 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bceidbasic_idp.keycloak_oidc_identity_provider.this must be replaced
-/+ resource "keycloak_oidc_identity_provider" "this" {
      ~ alias                                   = "bceidbasic" -> "BCeID (Basic)" # forces replacement
      ~ authorization_url                       = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidbasic/protocol/openid-connect/auth" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/BCeID (Basic)/protocol/openid-connect/auth"
      ~ client_secret                           = (sensitive value)
      ~ display_name                            = "bceidbasic" -> "BCeID (Basic)"
      ~ id                                      = "**********" -> (known after apply)
      ~ internal_id                             = "************************************" -> (known after apply)
      ~ jwks_url                                = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidbasic/protocol/openid-connect/certs" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/BCeID (Basic)/protocol/openid-connect/certs"
      ~ token_url                               = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidbasic/protocol/openid-connect/token" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/BCeID (Basic)/protocol/openid-connect/token"
      ~ user_info_url                           = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidbasic/protocol/openid-connect/userinfo" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/BCeID (Basic)/protocol/openid-connect/userinfo"
        # (23 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bceidbasic_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_user_guid"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbasic" -> "BCeID (Basic)" # forces replacement
        name                     = "bceid_user_guid"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bceidbasic_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_username"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbasic" -> "BCeID (Basic)" # forces replacement
        name                     = "bceid_username"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bceidbasic_idp_mappers.keycloak_custom_identity_provider_mapper.this["display_name"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbasic" -> "BCeID (Basic)" # forces replacement
        name                     = "display_name"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bceidbasic_scope_mappers.keycloak_openid_client_scope.this will be updated in-place
  ~ resource "keycloak_openid_client_scope" "this" {
      ~ description            = "bceidbasic idp client scope" -> "BCeID (Basic) idp client scope"
        id                     = "749045a5-e5b6-4229-8beb-dd646a6b3e4d"
      ~ name                   = "bceidbasic" -> "BCeID (Basic)"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bceidboth_idp.keycloak_oidc_identity_provider.this must be replaced
-/+ resource "keycloak_oidc_identity_provider" "this" {
      ~ alias                                   = "bceidboth" -> "BCeID (Basic + Business)" # forces replacement
      ~ authorization_url                       = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidboth/protocol/openid-connect/auth" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/BCeID (Basic + Business)/protocol/openid-connect/auth"
      ~ client_secret                           = (sensitive value)
      ~ display_name                            = "bceidboth" -> "BCeID (Basic + Business)"
      ~ id                                      = "*********" -> (known after apply)
      ~ internal_id                             = "************************************" -> (known after apply)
      ~ jwks_url                                = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidboth/protocol/openid-connect/certs" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/BCeID (Basic + Business)/protocol/openid-connect/certs"
      ~ token_url                               = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidboth/protocol/openid-connect/token" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/BCeID (Basic + Business)/protocol/openid-connect/token"
      ~ user_info_url                           = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidboth/protocol/openid-connect/userinfo" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/BCeID (Basic + Business)/protocol/openid-connect/userinfo"
        # (23 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bceidboth_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_business_guid"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidboth" -> "BCeID (Basic + Business)" # forces replacement
        name                     = "bceid_business_guid"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bceidboth_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_business_name"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidboth" -> "BCeID (Basic + Business)" # forces replacement
        name                     = "bceid_business_name"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bceidboth_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_user_guid"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidboth" -> "BCeID (Basic + Business)" # forces replacement
        name                     = "bceid_user_guid"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bceidboth_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_username"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidboth" -> "BCeID (Basic + Business)" # forces replacement
        name                     = "bceid_username"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bceidboth_idp_mappers.keycloak_custom_identity_provider_mapper.this["display_name"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidboth" -> "BCeID (Basic + Business)" # forces replacement
        name                     = "display_name"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bceidboth_scope_mappers.keycloak_openid_client_scope.this will be updated in-place
  ~ resource "keycloak_openid_client_scope" "this" {
      ~ description            = "bceidboth idp client scope" -> "BCeID (Basic + Business) idp client scope"
        id                     = "f23a0025-e58b-4177-a651-db5cc0672038"
      ~ name                   = "bceidboth" -> "BCeID (Basic + Business)"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bceidbusiness_idp.keycloak_oidc_identity_provider.this must be replaced
-/+ resource "keycloak_oidc_identity_provider" "this" {
      ~ alias                                   = "bceidbusiness" -> "BCeID (Business)" # forces replacement
      ~ authorization_url                       = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidbusiness/protocol/openid-connect/auth" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/BCeID (Business)/protocol/openid-connect/auth"
      ~ client_secret                           = (sensitive value)
      ~ display_name                            = "bceidbusiness" -> "BCeID (Business)"
      ~ id                                      = "*************" -> (known after apply)
      ~ internal_id                             = "************************************" -> (known after apply)
      ~ jwks_url                                = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidbusiness/protocol/openid-connect/certs" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/BCeID (Business)/protocol/openid-connect/certs"
      ~ token_url                               = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidbusiness/protocol/openid-connect/token" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/BCeID (Business)/protocol/openid-connect/token"
      ~ user_info_url                           = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bceidbusiness/protocol/openid-connect/userinfo" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/BCeID (Business)/protocol/openid-connect/userinfo"
        # (23 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bceidbusiness_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_business_guid"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbusiness" -> "BCeID (Business)" # forces replacement
        name                     = "bceid_business_guid"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bceidbusiness_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_business_name"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbusiness" -> "BCeID (Business)" # forces replacement
        name                     = "bceid_business_name"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bceidbusiness_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_user_guid"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbusiness" -> "BCeID (Business)" # forces replacement
        name                     = "bceid_user_guid"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bceidbusiness_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_username"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbusiness" -> "BCeID (Business)" # forces replacement
        name                     = "bceid_username"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bceidbusiness_idp_mappers.keycloak_custom_identity_provider_mapper.this["display_name"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bceidbusiness" -> "BCeID (Business)" # forces replacement
        name                     = "display_name"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bceidbusiness_scope_mappers.keycloak_openid_client_scope.this will be updated in-place
  ~ resource "keycloak_openid_client_scope" "this" {
      ~ description            = "bceidbusiness idp client scope" -> "BCeID (Business) idp client scope"
        id                     = "fd0a3bec-fc80-436f-9060-6b7b2f773df6"
      ~ name                   = "bceidbusiness" -> "BCeID (Business)"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp.keycloak_oidc_identity_provider.this must be replaced
-/+ resource "keycloak_oidc_identity_provider" "this" {
      ~ alias                                   = "bcsc1" -> "BCSC1" # forces replacement
      ~ authorization_url                       = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bcsc1/protocol/openid-connect/auth" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/BCSC1/protocol/openid-connect/auth"
      ~ client_secret                           = (sensitive value)
      ~ display_name                            = "bcsc1" -> "BCSC1"
      ~ id                                      = "*****" -> (known after apply)
      ~ internal_id                             = "************************************" -> (known after apply)
      ~ jwks_url                                = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bcsc1/protocol/openid-connect/certs" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/BCSC1/protocol/openid-connect/certs"
      ~ token_url                               = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bcsc1/protocol/openid-connect/token" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/BCSC1/protocol/openid-connect/token"
      ~ user_info_url                           = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bcsc1/protocol/openid-connect/userinfo" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/BCSC1/protocol/openid-connect/userinfo"
        # (23 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["address"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "BCSC1" # forces replacement
        name                     = "address"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["age"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "BCSC1" # forces replacement
        name                     = "age"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["age19OrOver"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "BCSC1" # forces replacement
        name                     = "age19OrOver"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["birthDate"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "BCSC1" # forces replacement
        name                     = "birthDate"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["country"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "BCSC1" # forces replacement
        name                     = "country"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["display_name"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "BCSC1" # forces replacement
        name                     = "display_name"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["email"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "BCSC1" # forces replacement
        name                     = "email"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["firstName"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "BCSC1" # forces replacement
        name                     = "firstName"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["gender"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "BCSC1" # forces replacement
        name                     = "gender"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["lastName"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "BCSC1" # forces replacement
        name                     = "lastName"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["locality"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "BCSC1" # forces replacement
        name                     = "locality"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["postalCode"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "BCSC1" # forces replacement
        name                     = "postalCode"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["region"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "BCSC1" # forces replacement
        name                     = "region"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["streetAddress"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "BCSC1" # forces replacement
        name                     = "streetAddress"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_openid_client_scope.this will be updated in-place
  ~ resource "keycloak_openid_client_scope" "this" {
      ~ description            = "bcsc1 idp client scope" -> "BCSC1 idp client scope"
        id                     = "3d1d9601-9eae-4067-ad93-e8232d0de95c"
      ~ name                   = "bcsc1" -> "BCSC1"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.idir_idp.keycloak_oidc_identity_provider.this must be replaced
-/+ resource "keycloak_oidc_identity_provider" "this" {
      ~ alias                                   = "idir" -> "IDIR" # forces replacement
      ~ authorization_url                       = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/idir/protocol/openid-connect/auth" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/IDIR/protocol/openid-connect/auth"
      ~ client_secret                           = (sensitive value)
      ~ display_name                            = "idir" -> "IDIR"
      ~ id                                      = "****" -> (known after apply)
      ~ internal_id                             = "************************************" -> (known after apply)
      ~ jwks_url                                = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/idir/protocol/openid-connect/certs" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/IDIR/protocol/openid-connect/certs"
      ~ token_url                               = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/idir/protocol/openid-connect/token" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/IDIR/protocol/openid-connect/token"
      ~ user_info_url                           = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/idir/protocol/openid-connect/userinfo" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/IDIR/protocol/openid-connect/userinfo"
        # (23 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.idir_idp_mappers.keycloak_custom_identity_provider_mapper.this["display_name"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "idir" -> "IDIR" # forces replacement
        name                     = "display_name"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.idir_idp_mappers.keycloak_custom_identity_provider_mapper.this["idir_user_guid"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "idir" -> "IDIR" # forces replacement
        name                     = "idir_user_guid"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.idir_idp_mappers.keycloak_custom_identity_provider_mapper.this["idir_username"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "idir" -> "IDIR" # forces replacement
        name                     = "idir_username"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.idir_scope_mappers.keycloak_openid_client_scope.this will be updated in-place
  ~ resource "keycloak_openid_client_scope" "this" {
      ~ description            = "idir idp client scope" -> "IDIR idp client scope"
        id                     = "f330ca06-8048-4d83-b0af-71ecdfeac599"
      ~ name                   = "idir" -> "IDIR"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard_clients.module.demo-app-1-5-31-2477.keycloak_openid_client_default_scopes.idp_scopes will be updated in-place
  ~ resource "keycloak_openid_client_default_scopes" "idp_scopes" {
      ~ default_scopes = [
          + "BCSC1",
          + "BCeID (Basic + Business)",
          + "BCeID (Basic)",
          + "BCeID (Business)",
          + "IDIR",
          - "bceidbasic",
          - "bceidboth",
          - "bceidbusiness",
          - "bcsc1",
          - "idir",
            # (3 unchanged elements hidden)
        ]
        id             = "standard/964536b8-fd89-4a03-a14a-e8275c700515"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard_clients.module.demo-app-2-6-01-2477.keycloak_openid_client_default_scopes.idp_scopes will be updated in-place
  ~ resource "keycloak_openid_client_default_scopes" "idp_scopes" {
      ~ default_scopes = [
          + "BCSC1",
          + "BCeID (Basic + Business)",
          + "BCeID (Basic)",
          + "BCeID (Business)",
          + "IDIR",
          - "bceidbasic",
          - "bceidboth",
          - "bceidbusiness",
          - "bcsc1",
          - "idir",
            # (3 unchanged elements hidden)
        ]
        id             = "standard/204c75b0-9d12-4b60-acfc-6c6207294bca"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard_clients.module.demo-testing-5-16-3644.keycloak_openid_client_default_scopes.idp_scopes will be updated in-place
  ~ resource "keycloak_openid_client_default_scopes" "idp_scopes" {
      ~ default_scopes = [
          + "BCSC1",
          + "BCeID (Basic + Business)",
          + "BCeID (Basic)",
          + "BCeID (Business)",
          + "IDIR",
          - "bceidbasic",
          - "bceidboth",
          - "bceidbusiness",
          - "bcsc1",
          - "idir",
            # (3 unchanged elements hidden)
        ]
        id             = "standard/12d7da07-cb68-4997-9a25-5ba6f5b0898a"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbasic.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_user_guid"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "bceid_user_guid"
      ~ realm_id        = "**********" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbasic.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_username"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "bceid_username"
      ~ realm_id        = "**********" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbasic.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["display_name"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "display_name"
      ~ realm_id        = "**********" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidboth.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_business_guid"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "bceid_business_guid"
      ~ realm_id        = "*********" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidboth.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_business_name"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "bceid_business_name"
      ~ realm_id        = "*********" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidboth.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_user_guid"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "bceid_user_guid"
      ~ realm_id        = "*********" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidboth.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_username"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "bceid_username"
      ~ realm_id        = "*********" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidboth.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["display_name"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "display_name"
      ~ realm_id        = "*********" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbusiness.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_business_guid"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "bceid_business_guid"
      ~ realm_id        = "*************" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbusiness.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_business_name"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "bceid_business_name"
      ~ realm_id        = "*************" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbusiness.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_user_guid"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "bceid_user_guid"
      ~ realm_id        = "*************" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbusiness.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["bceid_username"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "bceid_username"
      ~ realm_id        = "*************" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbusiness.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["display_name"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "display_name"
      ~ realm_id        = "*************" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["address"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "address"
      ~ realm_id        = "*****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["age"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "age"
      ~ realm_id        = "*****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["age19OrOver"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "age19OrOver"
      ~ realm_id        = "*****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["birthDate"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "birthDate"
      ~ realm_id        = "*****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["country"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "country"
      ~ realm_id        = "*****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["display_name"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "display_name"
      ~ realm_id        = "*****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["email"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "email"
      ~ realm_id        = "*****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["firstName"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "firstName"
      ~ realm_id        = "*****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["gender"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "gender"
      ~ realm_id        = "*****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["lastName"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "lastName"
      ~ realm_id        = "*****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["locality"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "locality"
      ~ realm_id        = "*****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["postalCode"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "postalCode"
      ~ realm_id        = "*****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["region"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "region"
      ~ realm_id        = "*****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["streetAddress"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "streetAddress"
      ~ realm_id        = "*****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.idir.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["display_name"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "display_name"
      ~ realm_id        = "****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.idir.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["idir_user_guid"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "idir_user_guid"
      ~ realm_id        = "****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.idir.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["idir_username"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "idir_username"
      ~ realm_id        = "****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.master_idir_link.module.idp_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["display_name"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "display_name"
      ~ realm_id        = "****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.master_idir_link.module.idp_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["idir_user_guid"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "idir_user_guid"
      ~ realm_id        = "****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.master_idir_link.module.idp_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["idir_username"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "idir_username"
      ~ realm_id        = "****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

Plan: 152 to add, 8 to change, 152 to destroy.
```
</details>

:memo: Plan generated in [Runs KeyCloak terraform plan #41](https://github.com/bcgov/social-access-portal/actions/runs/2459010842)